SWMM_CFD/Case/OpenFOAM/manhole1/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          50;
        startFace       53852;
    }
    atmosphere
    {
        type            patch;
        nFaces          173;
        startFace       53902;
    }
    outlet
    {
        type            patch;
        nFaces          48;
        startFace       54075;
    }
    walls
    {
        type            patch;
        nFaces          7973;
        startFace       54123;
    }
)

// ************************************************************************* //
